[
  "A good programmer looks both ways before crossing a one-way street. - Doug Linder",
  "C++: An octopus made by nailing extra legs onto a dog.",
  "I'm not a great programmer; I'm just a good programmer with great habits. - Kent Beck",
  "When all else fails … reboot.",
  "Machine learning is like teenage sex: Everyone talks about it, nobody really knows how to do it, everyone thinks everyone else is doing it, so everyone claims they are doing it.",
  "Why don't programmers like nature? Too many bugs.",
  "AI is like a mirror: It reflects the biases of its creators.",
  "We can build systems that are provably correct only when we have a formal model of what 'correct' is. - Fred Brooks",
  "Without requirements or design, programming is the art of adding bugs to an empty text file. - Louis Srygley",
  "The best method for accelerating a computer is the one that boosts it by 9.8 m/s². - Anonymous",
  "Simplicity is prerequisite for reliability. - Edsger Dijkstra",
  "When we had no computers, we had no programming problems either.",
  "How many programmers does it take to change a light bulb? None, that's a hardware problem.",
  "React developers are always in a state of confusion.",
  "Programmer's partner: \"Are you going to sit and type in front of that thing all day, or are you going out with me?\" Programmer: \"Yes.\"",
  "Don't worry if it doesn't work right. If everything did, you'd be out of a job. - Mosher’s Law of Software Engineering",
  "Git push --force: Because sometimes, history is better rewritten.",
  "There's no 'CTRL' button on Chuck Norris's keyboard. Chuck Norris is always in control.",
  "Vim: The only editor that's also a game of 'How do I exit this thing?'",
  "Why do React developers prefer functional components? Because they're stateless!",
  "One of the main causes of the fall of the Roman Empire was that lacking zero, they had no way to indicate successful termination of their C programs.",
  "Copy-and-Paste was programmed by programmers for programmers actually.",
  "I have always wished that my computer would be as easy to use as my telephone. My wish has come true. I no longer know how to use my telephone.",
  "Computers are good at following instructions but not at reading your mind.",
  "TypeScript: Because sometimes, any just isn't good enough.",
  "AI doesn't want to take your job. It just wants to do it better than you.",
  "Chuck Norris doesn't need garbage collection because he doesn't call .Dispose(), he calls .Destroy().",
  "Potential partners are like internet domain names — the ones I like are already taken.",
  "Q: Is the glass half-full or half-empty? A: The glass is twice as big as it needs to be.",
  "It's OK to figure out murder mysteries, but you shouldn't need to figure out code. You should be able to read it. - Steve McConnell",
  "One of my most productive days was throwing away 1,000 lines of code. - Ken Thompson",
  "AI is like a box of chocolates. You never know what you're gonna get, but it's probably biased.",
  "Talk is cheap. Show me the code. - Linus Torvalds",
  "Weeks of programming can save you hours of planning. - Unknown",
  "Programming isn't about what you know; it's about what you can figure out. - Chris Pine",
  "The function of good software is to make the complex appear to be simple. - Grady Booch",
  "The only way to go fast, is to go well. - Robert C. Martin",
  "The best thing about a boolean is even if you are wrong, you are only off by a bit.",
  "It's not a bug — it's an undocumented feature.",
  "Why did the AI cross the road? Because the training data said it was a good idea.",
  "There is an easy way and a hard way. The hard part is finding the easy way.",
  "The best way to get accurate information on Usenet is to post something wrong and wait for corrections.",
  "There's no obfuscated Perl contest because it's pointless.",
  "There is no Ctrl-Z in life.",
  "In a room full of top software designers, if two agree on the same thing, that's a majority. - Bill Curtis",
  "Whitespace is never white.",
  "William Shakespeare's question 2B OR NOT 2B = FF",
  "React hooks are like fishing hooks: Easy to use, hard to master.",
  "If at first, you don't succeed, call it version 1.0.",
  "To understand what recursion is, you must first understand recursion.",
  "Keyboard Failure. Press F1 to continue.",
  "Good design adds value faster than it adds cost. - Thomas C. Gale",
  "There's no place like 127.0.0.1.",
  "Software testing is a sport like hunting, it's bughunting.",
  "Good code is its own best documentation. As you're about to add a comment, ask yourself, 'How can I improve the code so that this comment isn't needed?' - Steve McConnell",
  "vi vi vi — the editor of the beast.",
  "Linux is only free if your time has no value.",
  "AI is the answer. What was the question again?",
  "System programmers are the high priests of a low cult.",
  "Controlling complexity is the essence of computer programming. - Brian Kernighan",
  "Should one learn Advanced BASIC programming language?",
  "When your hammer is C++, everything begins to look like a thumb.",
  "A system administrator has two problems: 1. Dumb users. 2. Smart users.",
  "Computers make very fast, very accurate mistakes.",
  "React: Because manipulating the DOM yourself is so 2015.",
  "It works on my machine.",
  "In programming, the hard part isn't solving problems, but deciding what problems to solve. - Paul Graham",
  "Code is like humor. When you have to explain it, it's bad.",
  "Machine learning is like raising a child. It takes a lot of training, and you're never sure what it'll do next.",
  "Kill a tree, save a byte: print your code.",
  "C++: Where your friends have access to your private members.",
  "Weekends are a myth to programmers, just like the cloud is just someone else's computer.",
  "Docker: Ensuring it works on more than just the developer's machine.",
  ".NET is called .NET so that it wouldn't show up in a UNIX directory listing.",
  "Algorithm: Word used by programmers when they don't want to explain what they did.",
  "Vim users don't use IDEs, they ARE the IDE.",
  "There are only two hard things in computer science: cache invalidation and naming things.",
  "I told my computer I needed a break, and now it won't stop sending me Java updates.",
  "Code never lies, comments sometimes do.",
  "A son asked his father (a programmer) why the sun rises in the east, and sets in the west. His response? It works, don't touch!",
  "Why do programmers prefer dark mode? Light attracts bugs.",
  "Walkthrough: A meeting where computer code is verbally described in excruciating detail while onlookers become increasingly inattentive.",
  "In case of a fire at a software company: Git - commit and push.",
  "Some people when confronted with a problem think \"I know, I'll use regular expressions.\" Now they have two problems.",
  "AI doesn't replace jobs, it creates new ones... like 'AI Ethics Officer.'",
  "COBOL programmers understand why women hate periods.",
  "Less code equals less bugs. - Kevlin Henney",
  "To iterate is human, to recurse divine.",
  "TypeScript: Making JavaScript developers feel superior since 2012.",
  "To err is human, but to really foul things up you need a computer. - Paul Ehrlich",
  "Programming is like sex: one mistake and you have to support it for the rest of your life.",
  "Code is like a poem; it's not just something we write to reach some practical result. - Donald Knuth",
  "Walking on water and developing software from a specification are easy if both are frozen. - Edward V Berard",
  "React hooks are like fishing: You never know what state you'll catch.",
  "It compiles; ship it.",
  "Vim users never exit... they just :q!",
  "If debugging is the process of removing bugs, then programming must be the process of putting them in. - Edsger Dijkstra",
  "Any fool can write code that a computer can understand. Good programmers write code that humans can understand. - Martin Fowler",
  "Most of you are familiar with the virtues of a programmer. There are three, of course: laziness, impatience, and hubris."
]