[
  "One of the main causes of the fall of the Roman Empire was that lacking zero, they had no way to indicate successful termination of their C programs.",
  "UNIX is simple. It just takes a genius to understand its simplicity.",
  "Debugging is like trying to find a needle in a haystack, except the needle is not in the haystack, but somewhere in the haystack factory.",
  "Chuck Norris's keyboard has two keys: 0 and 1.",
  "JavaScript logic: 0 == \"0\" and 0 == []; therefore, \"0\" != []",
  "Most of you are familiar with the virtues of a programmer. There are three, of course: laziness, impatience, and hubris.",
  "I'm not a great programmer; I'm just a good programmer with great habits. - Kent Beck",
  "Software and cathedrals are much the same — first we build them, then we pray.",
  "Python: Executable pseudocode. Perl: Executable line noise.",
  "React developers don't get errors, they get 'unexpected features.'",
  "When all else fails … reboot.",
  "There is no Ctrl-Z in life.",
  "Why programmers like UNIX: unzip, strip, touch, finger, grep, mount, fsck, more, yes, fsck, fsck, fsck, umount, sleep.",
  "Less code equals less bugs. - Kevlin Henney",
  "A son asked his father (a programmer) why the sun rises in the east, and sets in the west. His response? It works, don't touch!",
  "Docker: Ensuring it works on more than just the developer's machine.",
  "The best thing about a boolean is even if you are wrong, you are only off by a bit.",
  "Vim: The only editor that's also a game of 'How do I exit this thing?'",
  "Vim users never exit... they just :q!",
  "Why do Java developers wear glasses? Because they can't C#.",
  "A primary cause of complexity is that software vendors uncritically adopt almost any feature that users want. - Niklaus Wirth",
  "There are two ways to write error-free programs; only the third one works. - Alan J. Perlis",
  "Algorithm: Word used by programmers when they don't want to explain what they did.",
  "vi vi vi — the editor of the beast.",
  "In C we had to code our own bugs. In C++ we can inherit them.",
  "To understand what recursion is, you must first understand recursion.",
  "I'm not interrupting you, I'm putting our conversation in async mode.",
  "TypeScript: Because sometimes, any just isn't good enough.",
  "Software testing is a sport like hunting, it's bughunting.",
  "When we had no computers, we had no programming problems either.",
  "Kubernetes: For when you want to turn 'it works on my machine' into 'it works on every machine.'",
  "GraphQL: Because sometimes REST isn't restful enough.",
  "AI is like a Swiss Army knife: Versatile, but you wouldn't want to perform surgery with it.",
  "There's no obfuscated Perl contest because it's pointless."
]